edited readme. pushed directly to main cuz im him
